start = """سلام دوست من 👋
🏫 به کمک درسیار میتونی در هر زمان و مکانی به سوالات درسی دسترسی داشته باشی!

📖 ویژگی های درسیار:
💫 دسترسی به سوالات درسی در هر پایه و مبحثی

🙋‍♂️ برای شروع، پایه تحصیلی خودت رو انتخاب کن:"""

new_grade = "پایه تحصیلی خود را انتخاب کنید :"

channel = "ble.ir/join/33meCDte4u"
support = "@mhk488"
new_question = "درس مورد نظر را انتخاب کنید"
class MenuStrings():
    new_question="⁉️ سوال جدید"
    change_grade="⚙️ تغییر پایه تحصیلی"
    channel="📣 کانال اطلاع رسانی"
    support="🙋‍♂️ پشتیبانی"