start = """سلام {} 👋
🏫 به کمک درسیار میتونی در هر زمان و مکانی به سوالات درسی دسترسی داشته باشی!

📖 ویژگی های درسیار:
💫 دسترسی به سوالات درسی در هر پایه و مبحثی
💫 تصحیح پاسخ شما به وسیله هوش مصنوعی
💫 ساخت آزمون به صورت فایل pdf

🙋‍♂️ برای شروع، نقش خودت رو انتخاب کن:"""

new_grade = """⚙️ *تغییر پایه تحصیلی* ⚙️

پایه تحصیلی‌تون رو انتخاب کنید:"""

confirm_grade = """🎓 شما در {} هستید.

🙋‍♂️ هر جا مشکلی داشتی، از دستور /help استفاده کن.

⬅️ لطفا از طریق مِنو یک گزینه را انتخاب کنید:"""

channel = """🔔 لینک کانال اطلاع رسانی بازوی درسیار در بله:‌ [لینک کانال](ble.ir/join/33meCDte4u)

🗣️ بازوی ما را به دوستان خود معرفی کنید"""

support = """💬 برای پشتیبانی با آیدی @ilia_soleimani_helli3 در بله در تماس باشید.

📧 همچنین می‌توانید به آدرس darsyar.balebot@gmail.com ایمیل بزنید."""

unknown = """🥺 متاسفانه متوجه پیامت نشدم.

✅ لطفا برای استفاده از بازو، از منوی زیر گزینه‌ی مد نظرت رو انتخاب کن."""

student = "👨‍🎓 دانش آموز"
teacher = "👨‍🏫 مدرس"

choose_class = """? برای حل یک سوال جدید آماده هستید ¿

⏳ لطفا درس مورد نظر را انتخاب کنید :"""

choose_unit = """✅ شما درس *{}* را انتخاب کرده‌اید.

💯 درسیار به *{}* سوال در این درس دسترسی دارد.

⏳ لطفا فصل مورد نظر را انتخاب کنید: """

show_answer = "نمایش پاسخ 👀"

answer_text = """✅ شما درخواست نمایش پاسخ را کرده‌اید.

⁉️ سوال
{}

🙋‍♂️ پاسخ
{}"""

next_question = "سوال بعدی ⏭️"

wait = "⏳ لطفا منتظر بمانید. ⏳"
question = """✅ شما فصل *{}* را انتخاب کرده‌اید.

⁉️ سوال
{}"""

show_help = "نمایش منو 📋"

help = "📋 لطفا برای دسترسی به قابلیت‌های بازوی درسیار، منوی زیر را استفاده کنید."

ai_answer = """💯 نمره پاسخ شما: *{}* از ۵

💬 توضیح هوش مصنوعی: {}

✅ پاسخ صحیح: {}
"""

check_answer = "چک کردن پاسخ با هوش مصنوعی 🤖"

send_answer = """✅ شما گزینه‌ی *چک کردن پاسخ با هوش مصنوعی* را انتخاب کرده‌اید.

⏳ لطفا پاسخ خود را به سوال فوق ارسال کنید:

📝 کاربر محترم لطفا دقت کنید که در هنگام انتظار بازو برای پاسخ شما، هر ورودی به نشانه‌ی پاسخ بوده و قابلیت‌های دیگر بازو تا زمانی که پاسخ را ارسال کنید غیرفعال می‌شود."""

score = """💯 شما تا الان *{}* امتیاز به دست آورده‌اید.

🏅 شما نفر *{}* ام بین تمام استفاده کنندگان درسیار هستید.

📝 توجه کنید که کسب امتیاز فقط از طریق حل سوالاتی که تا به حال حل نکرده‌اید اتفاق میفتد و امتیاز کسب شده بر اساس نمره‌ی تعلق گرفته به شما از طرف هوش مصنوعی است."""

test_caption = """📄 آزمون *{}*
🏛️ درس: *{}*
📌 مبحث: *{}*

🎓 درسیار | بازوی هوشمند کمک درسی در بله
@darsyarbot"""

class MenuStrings():
    show_score = "💯 نمایش امتیاز"
    new_question="⁉️ سوال جدید"
    new_test = "📝 آزمون جدید"
    change_grade="⚙️ تغییر پایه تحصیلی"
    channel="📣 کانال اطلاع رسانی"
    support="☎️ تماس با ما"