start = """سلام {} 👋
🏫 به کمک درسیار میتونی در هر زمان و مکانی به سوالات درسی دسترسی داشته باشی!

📖 ویژگی های درسیار:
💫 دسترسی به سوالات درسی در هر پایه و مبحثی

🙋‍♂️ برای شروع، پایه تحصیلی خودت رو انتخاب کن:"""

new_grade = "🎓 برای دسترسی به قابلیت‌ها به صورت هرچه راحت‌تر، لطفا پایه و رشته‌ی تحصیلیتون رو انتخاب کنید:"

channel = """🔔 لینک به کانال اطلاع رسانی بازوی درسیار در بله:‌ ble.ir/join/33meCDte4u

بازوی ما را به دوستان خود معرفی کنید 🗣️"""

support = "@mhk488"

choose_class = """? برای حل یک سوال جدید آماده هستید ¿

⏳ لطفا درس مورد نظر را انتخاب کنید :"""

choose_unit = """✅ شما درس *{}* را انتخاب کرده‌اید.

⏳ لطفا فصل مورد نظر را انتخاب کنید: """

show_answer = "نمایش پاسخ 👀"
check_answer = "چک کردن پاسخ با هوش مصنوعی 🤖"
send_answer = """✅ شما گزینه‌ی *چک کردن پاسخ با هوش مصنوعی* را انتخاب کرده‌اید.

⏳ لطفا پاسخ خود را به سوال فوق ارسال کنید:

📝 کاربر محترم لطفا دقت کنید که در هنگام انتظار بازو برای پاسخ شما، هر ورودی به نشانه‌ی پاسخ بوده و قابلیت‌های دیگر بازو تا زمانی که پاسخ را ارسال کنید غیرفعال می‌شود."""

class MenuStrings():
    new_question="⁉️ سوال جدید"
    change_grade="⚙️ تغییر پایه تحصیلی"
    channel="📣 کانال اطلاع رسانی"
    support="🙋‍♂️ پشتیبانی"